# <font color = "green">1. Connect Drive</font>

In [2]:
from google.colab import drive
drive.mount('/content/drive')

ModuleNotFoundError: No module named 'google.colab'

In [2]:
# đường dẫn thư mục sẽ làm việc
WorkingPath ="/content/drive/MyDrive/TAI_LIEU_CUA_THAM/Codegym Online/"
%cd $WorkingPath

%pwd

/content/drive/MyDrive/TAI_LIEU_CUA_THAM/Codegym Online

'/content/drive/MyDrive/TAI_LIEU_CUA_THAM/Codegym Online'

In [7]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\hvc\appdata\local\programs\python\python310\lib\site-packages (1.5.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hvc\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\hvc\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.23.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\hvc\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\hvc\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

WARNING: Error parsing requirements for npm: [Errno 13] Permission denied: 'c:\\users\\hvc\\appdata\\local\\programs\\python\\python310\\lib\\site-packages\\npm-0.1.1-py3.10.egg-info\\requires.txt'
WARNING: Error parsing requirements for nodejs: [Errno 13] Permission denied: 'c:\\users\\hvc\\appdata\\local\\programs\\python\\python310\\lib\\site-packages\\nodejs-0.1.1-py3.10.egg-info\\requires.txt'
WARNING: Error parsing requirements for json5: [Errno 13] Permission denied: 'c:\\users\\hvc\\appdata\\local\\programs\\python\\python310\\lib\\site-packages\\json5-0.9.8-py3.10.egg-info\\requires.txt'

# <font color = "green">2. Import Libraries</font>

In [8]:
# Import necessary python libraries
import pandas as pd
import numpy as np
print("Khai báo thư viện thành công!")

Khai báo thư viện thành công!

# <font color = "green">3. Data</font>

In [3]:
# Load the dataset
Online_Retail = pd.read_csv("OnlineRetail.csv", encoding = "ISO-8859-1")

# Inspect the first 5 rows and all columns of the dataset
Online_Retail.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [4]:
Online_Retail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [9]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [11]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [12]:
display(df)

Empty DataFrame
Columns: []
Index: []

In [16]:
lst = ["Kế toán", "Kinh doanh", "Tiếp thị"]
df = pd.DataFrame(lst)
df

            0
0     Kế toán
1  Kinh doanh
2    Tiếp thị

In [19]:
df = pd.DataFrame(tuples)
df

            0      1
0     Kế toán   2000
1  Kinh doanh  21000
2    Tiếp thị   1900

In [21]:
tuples = [("Kế toán", 2000), ("Kinh doanh", 2100), ("Tiếp thị", 1900)]
df = pd.DataFrame(tuples, columns  = ["Nghề", "Lương"])
df

         Nghề  Lương
0     Kế toán   2000
1  Kinh doanh   2100
2    Tiếp thị   1900

In [24]:
dic = {'Công việc': ['Kỹ sư', 'Bác sĩ', 'Giáo viên'],\
       'Thu nhập': [3000, 3100, 2900]}
df = pd.DataFrame(dic)
df

   Công việc  Thu nhập
0      Kỹ sư      3000
1     Bác sĩ      3100
2  Giáo viên      2900

In [35]:
dict = {0: 'Kế toán', 1: 'Kinh doanh', 2: 'Tiếp thị'}
seri = pd.Series(dict)
seri

0       Kế toán
1    Kinh doanh
2      Tiếp thị
dtype: object

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Công việc  3 non-null      object
 1   Thu nhập   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [37]:
seri.info()

<class 'pandas.core.series.Series'>
Int64Index: 3 entries, 0 to 2
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      object
dtypes: object(1)
memory usage: 48.0+ bytes

In [38]:
print(seri)

0       Kế toán
1    Kinh doanh
2      Tiếp thị
dtype: object

In [39]:
display(seri)

0       Kế toán
1    Kinh doanh
2      Tiếp thị
dtype: object

In [40]:
print(df)

   Công việc  Thu nhập
0      Kỹ sư      3000
1     Bác sĩ      3100
2  Giáo viên      2900

In [41]:
display(df)

   Công việc  Thu nhập
0      Kỹ sư      3000
1     Bác sĩ      3100
2  Giáo viên      2900

In [42]:
arr = np.array([51, 65, 48, 59, 68])
seri2 = pd.Series(arr)
seri2

0    51
1    65
2    48
3    59
4    68
dtype: int32

In [53]:
seri = pd.Series(np.NaN, index = [0, 1, 2, 3, 4, 5])
seri

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
dtype: float64

In [50]:
seri = pd.Series(10, index = [0, 1, 2, 3, 4, 5])
seri = pd.Series(np.arange(1, 18, 2))
seri

0     1
1     3
2     5
3     7
4     9
5    11
6    13
7    15
8    17
dtype: int32

In [55]:
data = pd.read_csv('FoodPrice_in_Turkey.csv',
                  header = 0, encoding = "ISO-8859-1")
print('*' * 20, "Nhạp dữ liệu thành công", '*' * 20)
display(data)

******************** Nhạp dữ liệu thành công ********************

,Place,ProductId,ProductName,UmId,UmName,Month,Year,Price
0,National Average,52,Rice - Retail,5,KG,5,2013,4.4920
1,National Average,52,Rice - Retail,5,KG,6,2013,4.5786
2,National Average,52,Rice - Retail,5,KG,11,2013,4.7865
3,National Average,52,Rice - Retail,5,KG,12,2013,5.1337
4,National Average,52,Rice - Retail,5,KG,1,2014,5.5099
...,...,...,...,...,...,...,...,...
7376,Izmir,502,Cocoa (powder) - Retail,5,KG,8,2019,47.9040
7377,Izmir,502,Cocoa (powder) - Retail,5,KG,9,2019,49.1176
7378,Izmir,502,Cocoa (powder) - Retail,5,KG,10,2019,50.8347
7379,Izmir,502,Cocoa (powder) - Retail,5,KG,11,2019,51.7985
7380,Izmir,502,Cocoa (powder) - Retail,5,KG,12,2019,51.6071

In [57]:
data2 = pd.read_csv('FoodPrice_in_Turkey.csv', header = 0, encoding = 'UTF-8')
display(data2)

,Place,ProductId,ProductName,UmId,UmName,Month,Year,Price
0,National Average,52,Rice - Retail,5,KG,5,2013,4.4920
1,National Average,52,Rice - Retail,5,KG,6,2013,4.5786
2,National Average,52,Rice - Retail,5,KG,11,2013,4.7865
3,National Average,52,Rice - Retail,5,KG,12,2013,5.1337
4,National Average,52,Rice - Retail,5,KG,1,2014,5.5099
...,...,...,...,...,...,...,...,...
7376,Izmir,502,Cocoa (powder) - Retail,5,KG,8,2019,47.9040
7377,Izmir,502,Cocoa (powder) - Retail,5,KG,9,2019,49.1176
7378,Izmir,502,Cocoa (powder) - Retail,5,KG,10,2019,50.8347
7379,Izmir,502,Cocoa (powder) - Retail,5,KG,11,2019,51.7985
7380,Izmir,502,Cocoa (powder) - Retail,5,KG,12,2019,51.6071

In [59]:
print(data)

                 Place  ProductId              ProductName  UmId UmName  \
0     National Average         52            Rice - Retail     5     KG
1     National Average         52            Rice - Retail     5     KG
2     National Average         52            Rice - Retail     5     KG
3     National Average         52            Rice - Retail     5     KG
4     National Average         52            Rice - Retail     5     KG
...                ...        ...                      ...   ...    ...
7376             Izmir        502  Cocoa (powder) - Retail     5     KG
7377             Izmir        502  Cocoa (powder) - Retail     5     KG
7378             Izmir        502  Cocoa (powder) - Retail     5     KG
7379             Izmir        502  Cocoa (powder) - Retail     5     KG
7380             Izmir        502  Cocoa (powder) - Retail     5     KG

      Month  Year    Price
0         5  2013   4.4920
1         6  2013   4.5786
2        11  2013   4.7865
3        12  2013   5.1337
4         1  2014   5.5099
...     ...   ...      ...
7376      8  2019  47.9040
7377      9  2019  49.1176
7378     10  2019  50.8347
7379     11  2019  51.7985
7380     12  2019  51.6071

[7381 rows x 8 columns]

In [62]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7381 entries, 0 to 7380
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Place        7381 non-null   object
 1   ProductId    7381 non-null   int64
 2   ProductName  7381 non-null   object
 3   UmId         7381 non-null   int64
 4   UmName       7381 non-null   object
 5   Month        7381 non-null   int64
 6   Year         7381 non-null   int64
 7   Price        7381 non-null   float64
dtypes: float64(1), int64(4), object(3)
memory usage: 461.4+ KB

In [65]:
df.shape

(3, 2)